In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('words_new.csv',index_col='word')

In [3]:
data.shape

(4318, 2)

In [4]:
data.head()

      charcount  value
word
and           3     19
have          4     36
that          4     49
for           3     39
you           3     61

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4318 entries, and to dictate
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   charcount  4318 non-null   int64
 1   value      4318 non-null   int64
dtypes: int64(2)
memory usage: 101.2+ KB

In [6]:
data.shape

(4318, 2)

In [7]:
data.iloc['love']

TypeError: Cannot index by location index with a non-integer key

In [7]:
#data.loc[INDEX,COLUMN]
#data.loc[[INDEXs],[COLUMNs]]

In [8]:
data.loc['and':'you']

      charcount  value
word
and           3     19
have          4     36
that          4     49
for           3     39
you           3     61

In [9]:
data.loc["love"]

charcount     4
value        54
Name: love, dtype: int64

In [10]:
data.loc["love"]["value"]

54

In [11]:
data.loc["love","value"]

54

In [12]:
data['value'].max()

206

In [13]:
print(data.loc["fish","value"])
print(data.loc["cat","value"])
print(data.loc["man","value"])

42
24
28

In [14]:
data[data['value']==56]

          charcount  value
word
this              4     56
will              4     56
there             5     56
out               3     56
because           7     56
...             ...    ...
disabled          8     56
steak             5     56
mobile            6     56
thread            6     56
weave             5     56

[68 rows x 2 columns]

In [15]:
data.loc[["steak","fish","cat","man","mobile"]]

        charcount  value
word
steak           5     56
fish            4     42
cat             3     24
man             3     28
mobile          6     56

In [16]:
data.loc[["steak","fish","cat","man","mobile"],"value"]

word
steak     56
fish      42
cat       24
man       28
mobile    56
Name: value, dtype: int64

In [17]:
data["charcount"].max()

16

In [18]:
data.value.mode()

0    56
Name: value, dtype: int64

In [19]:
data["value"].mode()

0    56
Name: value, dtype: int64

In [20]:
data.value.value_counts()

value
56     68
73     64
60     62
81     62
50     59
       ..
11      1
5       1
184     1
200     1
12      1
Name: count, Length: 181, dtype: int64

In [21]:
data.loc[data.value==56].sample(10)

        charcount  value
word
attack          6     56
friend          6     56
term            4     56
down            4     56
this            4     56
light           5     56
flow            4     56
lobby           5     56
barrel          6     56
reduce          6     56

In [22]:
data.loc[(data['value']==56)].sort_values(by="charcount",ascending=False)

          charcount  value
word
mechanic          8     56
disabled          8     56
because           7     56
deficit           7     56
tactic            6     56
...             ...    ...
poet              4     56
iron              4     56
row               3     56
why               3     56
out               3     56

[68 rows x 2 columns]

In [23]:
data.loc[data['value']==56,'charcount'].min()

3

In [24]:
data[(data.value==56)&(data.charcount==data.loc[data['value']==56,'charcount'].min())]

      charcount  value
word
out           3     56
why           3     56
row           3     56

In [25]:
data['value_ratio']=data['value']/206

In [26]:
data

          charcount  value  value_ratio
word
and               3     19     0.092233
have              4     36     0.174757
that              4     49     0.237864
for               3     39     0.189320
you               3     61     0.296117
...             ...    ...          ...
spit              4     64     0.310680
kneel             5     47     0.228155
vacuum            6     81     0.393204
selected          8     73     0.354369
dictate           7     62     0.300971

[4318 rows x 3 columns]

In [27]:
data[data['value']==56]

          charcount  value  value_ratio
word
this              4     56     0.271845
will              4     56     0.271845
there             5     56     0.271845
out               3     56     0.271845
because           7     56     0.271845
...             ...    ...          ...
disabled          8     56     0.271845
steak             5     56     0.271845
mobile            6     56     0.271845
thread            6     56     0.271845
weave             5     56     0.271845

[68 rows x 3 columns]

In [30]:
data.query("value_ratio==0.271845").shape

(0, 3)

In [40]:
data[data['value']==56].value_ratio.min()

0.27184466019417475

In [42]:
data[data['value']==56].charcount.min()

3

In [51]:
data.query("value==56").sort_values(by='charcount').min()

charcount       3.000000
value          56.000000
value_ratio     0.271845
dtype: float64